{"modelTopology": {"backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "optimizer_config": {"config": {"lr": 0.0024999999441206455, "amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "decay": 0.0}, "class_name": "Adam"}, "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null}, "model_config": {"config": [{"config": {"bias_regularizer": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "trainable": true, "recurrent_dropout": 0.0, "units": 64, "return_sequences": true, "stateful": false, "name": "lstm_1", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": false, "unroll": false, "recurrent_regularizer": null, "go_backwards": false, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 200, 3], "use_bias": true, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "trainable": true, "recurrent_dropout": 0.0, "units": 64, "stateful": false, "name": "lstm_2", "recurrent_constraint": null, "unit_forget_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unroll": false, "recurrent_regularizer": null, "go_backwards": false, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "dropout": 0.0, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "use_bias": true, "return_state": false}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.1.4"}, "weightsManifest": [{"weights": [{"shape": [64, 64], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [64], "dtype": "float32", "name": "dense_1/bias"}], "paths": ["group1-shard1of1"]}, {"weights": [{"shape": [64, 6], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [6], "dtype": "float32", "name": "dense_2/bias"}], "paths": ["group2-shard1of1"]}, {"weights": [{"shape": [3, 256], "dtype": "float32", "name": "lstm_1/kernel"}, {"shape": [64, 256], "dtype": "float32", "name": "lstm_1/recurrent_kernel"}, {"shape": [256], "dtype": "float32", "name": "lstm_1/bias"}], "paths": ["group3-shard1of1"]}, {"weights": [{"shape": [64, 256], "dtype": "float32", "name": "lstm_2/kernel"}, {"shape": [64, 256], "dtype": "float32", "name": "lstm_2/recurrent_kernel"}, {"shape": [256], "dtype": "float32", "name": "lstm_2/bias"}], "paths": ["group4-shard1of1"]}]}