{"weightsManifest": [{"weights": [{"dtype": "float32", "shape": [32, 6], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [6], "name": "dense_1/bias"}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [9, 128], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [32, 128], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [128], "name": "lstm_1/bias"}], "paths": ["group2-shard1of1"]}], "modelTopology": {"model_config": {"config": [{"config": {"use_bias": true, "name": "lstm_1", "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "return_state": false, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_sequences": false, "activation": "tanh", "stateful": false, "go_backwards": false, "recurrent_regularizer": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "implementation": 1, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "batch_input_shape": [null, 128, 9], "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "dtype": "float32", "units": 32, "recurrent_constraint": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"rate": 0.5, "trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"use_bias": true, "activation": "sigmoid", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.1.4", "training_config": {"loss_weights": null, "optimizer_config": {"config": {"rho": 0.8999999761581421, "lr": 0.0010000000474974513, "decay": 0.0, "epsilon": 1e-07}, "class_name": "RMSprop"}, "metrics": ["accuracy"], "sample_weight_mode": null, "loss": "categorical_crossentropy"}, "backend": "tensorflow"}}