{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.4", "config": {"name": "model_1", "output_layers": [["activation_1", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 200, 3], "dtype": "float32", "name": "input_1"}}, {"name": "lstm_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_1", "dropout": 0.0, "return_state": false, "activity_regularizer": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "unit_forget_bias": true, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "activation": "tanh", "unroll": false, "recurrent_regularizer": null, "bias_regularizer": null, "trainable": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "return_sequences": true, "units": 64, "kernel_regularizer": null}}, {"name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "name": "lstm_2", "dropout": 0.0, "return_state": false, "activity_regularizer": null, "stateful": false, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "unit_forget_bias": true, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "go_backwards": false, "activation": "tanh", "unroll": false, "recurrent_regularizer": null, "bias_regularizer": null, "trainable": true, "recurrent_constraint": null, "recurrent_dropout": 0.0, "return_sequences": false, "units": 32, "kernel_regularizer": null}}, {"name": "dense_1", "inbound_nodes": [[["lstm_2", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"name": "elu_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 0.10000000149011612}}, {"name": "dense_2", "inbound_nodes": [[["elu_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_constraint": null, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"name": "activation_1", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "input_layers": [["input_1", 0, 0]]}}