{"weightsManifest": [{"weights": [{"dtype": "float32", "shape": [64, 64], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [64], "name": "dense_1/bias"}], "paths": ["group1-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [64, 6], "name": "dense_2/kernel"}, {"dtype": "float32", "shape": [6], "name": "dense_2/bias"}], "paths": ["group2-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [3, 256], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "lstm_1/bias"}], "paths": ["group3-shard1of1"]}, {"weights": [{"dtype": "float32", "shape": [64, 256], "name": "lstm_2/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "lstm_2/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "lstm_2/bias"}], "paths": ["group4-shard1of1"]}], "modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "amsgrad": false, "epsilon": 1e-07, "lr": 0.0024999999441206455, "beta_1": 0.8999999761581421, "decay": 0.0}}, "metrics": ["accuracy"], "sample_weight_mode": null}, "model_config": {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 64, "unroll": false, "kernel_constraint": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false, "return_sequences": true, "bias_regularizer": null, "batch_input_shape": [null, 200, 3], "return_state": false, "use_bias": true, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "dtype": "float32", "recurrent_constraint": null, "activation": "tanh", "name": "lstm_1", "kernel_regularizer": null}}, {"class_name": "LSTM", "config": {"activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "units": 64, "unroll": false, "kernel_constraint": null, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "stateful": false, "return_sequences": false, "bias_regularizer": null, "return_state": false, "use_bias": true, "dropout": 0.0, "unit_forget_bias": true, "trainable": true, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "implementation": 1, "recurrent_constraint": null, "activation": "tanh", "name": "lstm_2", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 64, "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 6, "name": "dense_2", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null}}]}}}