{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.4", "config": [{"class_name": "LSTM", "config": {"use_bias": true, "dropout": 0.0, "batch_input_shape": [null, 200, 3], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "lstm_1", "units": 64, "recurrent_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "dtype": "float32", "bias_constraint": null, "kernel_constraint": null, "go_backwards": false, "trainable": true, "stateful": false, "recurrent_constraint": null, "return_state": false, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"use_bias": true, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "return_sequences": false, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "lstm_2", "units": 64, "recurrent_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0, "l1": 0.009999999776482582}}, "implementation": 1, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "kernel_constraint": null, "go_backwards": false, "trainable": true, "stateful": false, "recurrent_constraint": null, "return_state": false, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "linear", "name": "dense_1", "trainable": true, "units": 64, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.1, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activation": "softmax", "name": "dense_2", "trainable": true, "units": 2, "activity_regularizer": null}}]}