{"keras_version": "2.1.4", "config": [{"config": {"dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "activation": "tanh", "implementation": 1, "go_backwards": false, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "unroll": false, "trainable": true, "recurrent_regularizer": null, "use_bias": true, "return_state": false, "batch_input_shape": [null, 200, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": true, "dtype": "float32", "unit_forget_bias": true, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "units": 64, "activation": "tanh", "implementation": 1, "go_backwards": false, "bias_constraint": null, "recurrent_dropout": 0.0, "stateful": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_2", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "recurrent_constraint": null, "unroll": false, "trainable": true, "recurrent_regularizer": {"config": {"l2": 0.0, "l1": 0.009999999776482582}, "class_name": "L1L2"}, "use_bias": true, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_sequences": false, "unit_forget_bias": true, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activation": "linear", "name": "dense_1", "use_bias": true, "units": 64, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"rate": 0.1, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activation": "softmax", "name": "dense_2", "use_bias": true, "units": 2, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}