{"modelTopology": {"model_config": {"config": [{"config": {"dropout": 0.0, "units": 64, "activation": "tanh", "implementation": 1, "go_backwards": false, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "lstm_1", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "return_sequences": true, "recurrent_constraint": null, "unroll": false, "trainable": true, "recurrent_regularizer": null, "return_state": false, "batch_input_shape": [null, 200, 3], "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "stateful": false, "dtype": "float32", "use_bias": true, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "activation": "tanh", "implementation": 1, "go_backwards": false, "bias_constraint": null, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "name": "lstm_2", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "unit_forget_bias": true, "return_sequences": false, "recurrent_constraint": null, "unroll": false, "trainable": true, "recurrent_regularizer": {"config": {"l2": 0.0, "l1": 0.009999999776482582}, "class_name": "L1L2"}, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "stateful": false, "use_bias": true, "activity_regularizer": null}, "class_name": "LSTM"}, {"config": {"rate": 0.5, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "units": 64, "activation": "linear", "use_bias": true, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"rate": 0.1, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "units": 2, "activation": "softmax", "use_bias": true, "name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}, "keras_version": "2.1.4", "training_config": {"metrics": ["accuracy"], "optimizer_config": {"config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "lr": 0.0024999999441206455, "amsgrad": false}, "class_name": "Adam"}, "sample_weight_mode": null, "loss": "categorical_crossentropy", "loss_weights": null}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [64, 64], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [64], "dtype": "float32", "name": "dense_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [64, 2], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [2], "dtype": "float32", "name": "dense_2/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [3, 256], "dtype": "float32", "name": "lstm_1/kernel"}, {"shape": [64, 256], "dtype": "float32", "name": "lstm_1/recurrent_kernel"}, {"shape": [256], "dtype": "float32", "name": "lstm_1/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [64, 256], "dtype": "float32", "name": "lstm_2/kernel"}, {"shape": [64, 256], "dtype": "float32", "name": "lstm_2/recurrent_kernel"}, {"shape": [256], "dtype": "float32", "name": "lstm_2/bias"}]}]}