{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [64, 64], "dtype": "float32", "name": "dense_1/kernel"}, {"shape": [64], "dtype": "float32", "name": "dense_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [64, 6], "dtype": "float32", "name": "dense_2/kernel"}, {"shape": [6], "dtype": "float32", "name": "dense_2/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [3, 256], "dtype": "float32", "name": "lstm_1/kernel"}, {"shape": [64, 256], "dtype": "float32", "name": "lstm_1/recurrent_kernel"}, {"shape": [256], "dtype": "float32", "name": "lstm_1/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [64, 256], "dtype": "float32", "name": "lstm_2/kernel"}, {"shape": [64, 256], "dtype": "float32", "name": "lstm_2/recurrent_kernel"}, {"shape": [256], "dtype": "float32", "name": "lstm_2/bias"}]}], "modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "training_config": {"sample_weight_mode": null, "optimizer_config": {"config": {"amsgrad": false, "lr": 0.0024999999441206455, "decay": 0.0, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "beta_1": 0.8999999761581421}, "class_name": "Adam"}, "metrics": ["accuracy"], "loss": "categorical_crossentropy", "loss_weights": null}, "model_config": {"config": [{"config": {"unit_forget_bias": true, "recurrent_regularizer": null, "go_backwards": false, "dtype": "float32", "implementation": 1, "use_bias": true, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activity_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh", "stateful": false, "unroll": false, "kernel_regularizer": null, "units": 64, "bias_regularizer": null, "bias_constraint": null, "return_sequences": true, "dropout": 0.0, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_constraint": null, "batch_input_shape": [null, 200, 3]}, "class_name": "LSTM"}, {"config": {"unit_forget_bias": true, "recurrent_regularizer": null, "go_backwards": false, "implementation": 1, "use_bias": true, "bias_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "tanh", "stateful": false, "name": "lstm_2", "kernel_regularizer": null, "units": 64, "activity_regularizer": null, "bias_constraint": null, "return_sequences": false, "dropout": 0.0, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"seed": null, "noise_shape": null, "rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "name": "dense_1", "use_bias": true, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "name": "dense_2", "use_bias": true, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "trainable": true, "kernel_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}}}